{
    "Header": {
      "Accueil": "Home",
      "Projets": "Progetti",
      "Contact": "Contatto"
    },
  
    "HomePage": {
      "Loc": "Grenoble - Francia",
      "Dev": "Sviluppatore",
  
      "Apropos": "Chi sono",
      "Idhugo": "Nato con il nome di Hugo BARBIERI, sono, da che io ricordi, appassionato di informatica. Dopo aver ottenuto il mio diploma di scuola superiore la scorsa estate, ora mi dedico a materie che mi appassionano, come lo sviluppo web e orientato agli oggetti e l'interfaccia utente, in un percorso formativo che mi rispecchia. Durante il mio primo anno nel BUT Informatica presso l'IUT2 di Grenoble, ho sviluppato competenze nella gestione dei progetti e nello sviluppo, che mi permettono di operare all'interno di un team di sviluppatori per portare a termine con successo un progetto informatico. La mia attrazione per l'innovazione e la mia sete di apprendere fanno di me il candidato ideale per contribuire in modo significativo a progetti informatici all'interno di un'azienda promettente.",
      "My+": "I miei +",
      "Facination": "Affascinato dal mondo dell'informatica e costantemente alla ricerca di innovazione, sono spinto dal desiderio di scoprire e imparare continuamente nuove cose!",
      "Lang": "Con un livello B2 in inglese e italiano, sono a mio agio nella comprensione di documenti tecnici e nel seguire una conversazione in queste lingue.",
      "Permis": "In possesso di una patente di guida di categoria B e di un veicolo, sono autonomo negli spostamenti.",
  
      "Projets": "Progetti",
      "Projetsd": "Progetto di",
      "Projetsde": "Progetto di",
      "ThisPortfolio": "Questo Portfolio",
      "ProjetPortfolio": "Per il rinnovamento del mio portfolio, ho adottato Next.js per migliorare le prestazioni e l'esperienza utente, modernizzando l'ergonomia e la grafica per una navigazione fluida e un aspetto visivo più professionale su tutti i dispositivi...",
      "ProjetChiefs": "Nel nostro progetto 'Chief's Arena,' abbiamo sviluppato un'applicazione JavaFX per facilitare la gestione di eventi culinari, e come capo squadra, ho coordinato lo sviluppo per offrire una soluzione intuitiva sia ai privati che ai professionisti del settore...",
      "PEtu": "Progetto studentesco",
      "ProjetEtu": "Il nostro team di 8 persone sta sviluppando un'innovativa applicazione web, combinando Next.js, React e Django, per offrire un'esperienza immersiva che valorizza il patrimonio mobile francese attraverso un'interfaccia moderna e intuitiva...",
      "Voir": "Vedi di più",
      "Janvier": "Gennaio",
      "Fevrier": "Febbraio",
      "Mars": "Marzo",
      "Avril": "Aprile",
      "Mai": "Maggio",
      "Juin": "Giugno",
      "Juillet": "Luglio",
      "Aout": "Agosto",
      "Septembre": "Settembre",
      "Octobre": "Ottobre",
      "Novembre": "Novembre",
      "Decembre": "Dicembre",
  
      "Contact": "Contatto",
      "ContactMe": "Contattami",
      "Genre": "Genere:",
      "M": "Sig.",
      "Mme": "Sig.ra",
      "Nom": "Nome:",
      "Ent": "Azienda:",
      "Mail": "Email:",
      "Mess": "Messaggio:",
      "Envoyer": "Invia",
      "VotreNom": "Il tuo nome",
      "VotreEnt": "La tua azienda",
      "VotreMail": "La tua email",
      "VotreMess": "Il tuo messaggio"
    },


    "ProjetsPage": {
        "MyProjets": "I miei progetti",
        "Intro": "Vi invito a esplorare i miei progetti in ordine cronologico, mettendo in luce il mio percorso e l'evoluzione delle mie competenze, dallo sviluppo di applicazioni innovative alla creazione di siti web.",
        "LienProjet": "Link al progetto",
        "P1": "Progetto studentesco: Creazione di un'applicazione Web",
        "P1-1": "Nel contesto di un ambizioso progetto studentesco, il nostro team di 8 persone ha l'obiettivo di progettare e sviluppare un'applicazione web dedicata alla valorizzazione della cultura francese, con un'attenzione particolare alla preservazione e promozione del patrimonio mobiliare.",
        "P1-2": "Utilizzeremo Next.js e React per costruire un front-end reattivo, fluido e moderno, che offra un'esperienza utente immersiva. Il back-end sarà sviluppato con Django, garantendo un'architettura solida, scalabile e facilmente mantenibile, capace di supportare un database ricco di contenuti patrimoniali. Grazie a questa combinazione di tecnologie, ci proponiamo di creare una piattaforma performante, scalabile e incentrata sulla scoperta del patrimonio culturale attraverso un'interfaccia moderna e intuitiva.",
        "P2": "Progetto aziendale: Ristrutturazione del mio portfolio",
        "P2-1": "Nel contesto della ristrutturazione completa del mio portfolio, ho scelto di adottare la tecnologia Next.js per migliorare le prestazioni complessive del sito e ottimizzare il rendering lato server per una maggiore reattività. Questo progetto mira anche a ripensare l'ergonomia, concentrandosi sull'esperienza utente: navigazione semplificata, accesso intuitivo alle informazioni e migliore accessibilità su tutti i tipi di dispositivi (mobile, tablet, desktop).",
        "P2-2": "Inoltre, ho intrapreso una ristrutturazione parziale della grafica per modernizzare l'aspetto visivo del sito. Questa nuova direzione grafica è accompagnata da scelte di colori, tipografie e elementi visivi che rafforzano la coerenza estetica e l'identità professionale del portfolio.",
        "P3": "Progetto studentesco: Creazione di un'applicazione",
        "P3-1": "Nel nostro progetto intitolato 'Chief's Arena,' il nostro team di 6 persone aveva l'obiettivo di progettare e sviluppare un'applicazione in JavaFX destinata ad assistere sia i privati che i professionisti dell'evento, concentrandosi in particolare sulla creazione e gestione di eventi culinari di tipo concorso. Questa applicazione innovativa offre una gamma di strumenti intuitivi che semplificano l'organizzazione, la pianificazione e il monitoraggio di questi eventi, facilitando ogni fase del processo per gli utenti.",
        "P3-2": "In qualità di",
        "P3-3": "capo squadra e sviluppatore",
        "P3-4": ", sono stato responsabile di coordinare i compiti tra i membri del team, supervisionare lo sviluppo tecnico e garantire la coerenza e la qualità complessiva del progetto. Il mio ruolo mi ha anche permesso di favorire una collaborazione efficace e di assicurarmi che gli obiettivi dell'applicazione fossero raggiunti nei tempi previsti, rispondendo alle esigenze degli utenti finali.",
        "P4": "Questo portfolio",
        "P4-1": "Il mio portfolio è un progetto in costante evoluzione, concepito per esplorare in profondità gli aspetti di React. Serve anche per presentare me stesso e i progetti su cui ho lavorato, offrendo così una panoramica delle mie competenze e delle mie esperienze.",
        "P4-2": "Ad ogni aggiornamento, mi impegno a migliorare l'esperienza utente, integrando funzionalità innovative e apportando significativi miglioramenti. Questi aggiornamenti includono l'aggiunta di nuove animazioni coinvolgenti che rendono la navigazione più dinamica e coinvolgente, oltre all'ottimizzazione dell'accessibilità per garantire un'esperienza ottimale per tutti gli utenti, indipendentemente dalle loro esigenze specifiche. Il mio impegno verso il miglioramento continuo e l'adattabilità di questo portfolio testimonia la mia volontà di rimanere all'avanguardia delle tecnologie web, creando un'interfaccia sia funzionale che estetica.",
        "P5": "Creazione di un videogioco su Terminal",
        "P5-1": "Gioco Faerun",
        "P5-2": "Nel contesto di un progetto studentesco, ho avuto l'opportunità di sviluppare un gioco intitolato Faerun, basato su un diagramma UML. Questo gioco, progettato per essere giocato su terminale, è un gioco strategico di conquista in cui il giocatore interpreta un re che cerca di conquistare il regno avversario.",
        "P5-3": "Il gameplay di Faerun consente ai giocatori di giocare contro un'IA, prendere decisioni cruciali e affrontare varie sfide.",
        "P6": "Gestione e analisi di un database",
        "P6-1": "Nel contesto di un progetto studentesco, ho intrapreso la pulizia di un database open source relativo al nutriscore degli alimenti, in particolare quello di OpenFoodFacts. Il mio obiettivo principale era mantenere solo le informazioni rilevanti relative alle bevande zuccherate francesi. Questo processo ha comportato un'attenzione meticolosa alla gestione di eventuali errori di inserimento commessi dai collaboratori, per garantire l'integrità e l'affidabilità dei dati.",
        "P6-2": "Dopo aver pulito e validato il database, ho utilizzato queste informazioni per elaborare un rapporto statistico approfondito. Questo rapporto esamina la relazione tra il nutriscore e i diversi valori nutrizionali di queste bevande, offrendo approfondimenti preziosi sulla qualità nutrizionale e le tendenze di consumo. Grazie a questa analisi, sono riuscito a evidenziare le implicazioni di questi dati sulla salute pubblica e le scelte dei consumatori.",
        "P7": "Progetto studentesco: Classificazione di dispacci",
        "P7-1": "Nel contesto di un progetto presso l'IUT2 di Grenoble, ho progettato uno script in Java destinato a classificare i dispacci in diverse categorie, come sport, cultura e politica. Questo script utilizza tecniche di analisi dei contenuti per classificare efficacemente i dispacci, basandosi su criteri predefiniti e parole chiave pertinenti.",
        "P7-2": "L'obiettivo di questo progetto era creare uno strumento in grado di automatizzare il processo di classificazione, facilitando l'accesso alle informazioni per gli utenti. Grazie ad algoritmi di elaborazione del testo, lo script può identificare il tema principale di ogni dispaccio, garantendo una classificazione appropriata e precisa. Questa esperienza mi ha permesso di approfondire le mie competenze in programmazione Java e nel trattamento dei dati, sviluppando al contempo una migliore comprensione delle sfide legate all'analisi dei contenuti.",
        "P8": "Progetto studentesco: Creazione e amministrazione di VM",
        "P8-1": "Durante il mio progetto studentesco, ho avuto l'opportunità di creare e amministrare una macchina virtuale (VM) su Linux per soddisfare i requisiti di base di una VM funzionale. Questo progetto mi ha permesso di acquisire competenze preziose in amministrazione di sistema.",
        "P8-2": "Ho configurato la VM per garantire prestazioni ottimali e un uso efficiente delle risorse, impostando parametri come memoria, archiviazione e connettività di rete. Inoltre, ho installato gli strumenti necessari per gestire e proteggere l'ambiente, garantendo la sua stabilità e affidabilità. Questa esperienza mi ha permesso di rafforzare la mia comprensione dei sistemi operativi ed esplorare le migliori pratiche nella gestione degli ambienti virtuali.",
        "P9": "Progetto studentesco: Analisi di un'azienda e creazione di un sito web",
        "P9-1": "Nel contesto di un progetto studentesco realizzato in gruppo di 3, ho avuto l'opportunità di analizzare l'azienda Orange Business sotto l'angolo della sua transizione ecologica. Questa analisi ha coinvolto l'esame delle iniziative e delle pratiche messe in atto dall'azienda per ridurre il suo impatto ambientale e promuovere soluzioni sostenibili.",
        "P9-2": "A seguito di questo studio, abbiamo sviluppato un sito web in HTML e CSS destinato a presentare l'azienda e mettere in evidenza i suoi sforzi per la transizione ecologica. Il sito evidenzia i progetti e le iniziative di Orange Business, sottolineando l'importanza del suo impegno verso un approccio più sostenibile. Grazie a questa esperienza, ho potuto unire le mie competenze tecniche nello sviluppo web a una riflessione critica sulle questioni ambientali, imparando a progettare un'interfaccia conviviale e informativa.",
        "P10": "Creazione di un sito web per un artigiano",
        "P10-1": "Durante i miei ultimi mesi di scuola superiore, ho avuto l'opportunità di realizzare un sito web in HTML e CSS per un artigiano edile. All'epoca, le mie conoscenze in sviluppo web erano ancora limitate e questo progetto rappresentava la mia prima esperienza nella creazione di un sito web completo.",
        "P10-2": "Da allora, ho notevolmente ampliato le mie competenze, in particolare in React, il che mi ha permesso di comprendere meglio le questioni legate alla progettazione e allo sviluppo web. Oggi, il mio obiettivo è ricostruire questo sito integrando le nuove conoscenze e tecniche che ho acquisito. Questo processo di ristrutturazione mi permetterà non solo di migliorare l'estetica e l'ergonomia del sito, ma anche di ottimizzarne le prestazioni e la funzionalità, offrendo al contempo un'esperienza utente arricchita.",
        "Janvier": "Gennaio",
        "Fevrier": "Febbraio",
        "Mars": "Marzo",
        "Avril": "Aprile",
        "Mai": "Maggio",
        "Juin": "Giugno",
        "Juillet": "Luglio",
        "Aout": "Agosto",
        "Septembre": "Settembre",
        "Octobre": "Ottobre",
        "Novembre": "Novembre",
        "Decembre": "Dicembre"
    },


    "Contact": {
    "ContactMe": "Contattami",
    "Genre": "Genere:",
    "M": "Sig.",
    "Mme": "Sig.ra.",
    "Nom": "Nome:",
    "Ent": "Azienda:",
    "Mail": "Email:",
    "Mess": "Messaggio:",
    "Envoyer": "Inviare",
    "VotreNom": "Il tuo nome",
    "VotreEnt": "La tua azienda",
    "VotreMail": "La tua email",
    "VotreMess": "Il tuo messaggio",
    "MyLinkedin": "Il mio Linkedin"
  },
  "Footer": {
    "Acces": "Accesso rapido",
    "Accueil": "Home",
    "Projets": "Progetti",
    "Contact": "Contatto",
    "Download": "Scarica il mio CV",
    "Reseaux": "I miei social"
  },
  "Caroussel": {
    "img": "Visualizza le immagini del progetto"
  }
}
  